import streamlit as st


def intro() -> None:
    st.write("# Строителни разрешения по кметски мандат, Община Пловдив")
    st.sidebar.success("Изберете мандат")
    st.markdown(
        """
        Данните са свалени от публичния регистър на Община Пловдив.
        Разделени са на два подтипа по възложител, първият са разрешителни 
        свързани с инфраструктурни проекти или такива възложени от общината. 
        Категоризирани са като "инфраструктурни". Ключовите думи, по които са
        филтрирани са:
        
        - "ЕВН"
        - "Община Пловдив"
        - "Електроразпределение"
        - "БТК"
        - "МЕГАЛАН"
        
        Вторият тип са всички останали, несъдържащи тези ключови думи в колоната
        "Възложител".
        

        **👈 Изберете кметски мандат от менюто в ляво.

        ### Източник

        - [ИСУТ Пловдив](http://isut.plovdiv.bg:998/map_default.phtml)
    """
    )


st.set_page_config(
    page_title="Строителни разрешения",
)
intro()
